[Killed] ConditionalExpression
src/services/openfga-client.ts:31:9
     const h: Record<string, string> = {
       'Content-Type': 'application/json',
     }
-    if (this.apiKey) {
+    if (true) {
       h['Authorization'] = `Bearer ${this.apiKey}`
     }
killedBy: PUT /api/connection returns 502 and reverts URL for unreachable URL
statusReason: fetch failed

[Killed] BlockStatement
src/services/openfga-client.ts:37:45
     return h
   }
 
-  async get(path: string): Promise<unknown> {
-    const url = `${this.baseUrl}${path}`
-    logger.debug({ url, method: 'GET' }, 'OpenFGA request')
-    const res = await fetch(url, { headers: this.headers() })
-    return this.handleResponse(res)
-  }
+  async get(path: string): Promise<unknown> {}
 
   async post(path: string, body: unknown): Promise<unknown> {
killedBy: PUT /api/connection returns 502 and reverts URL for unreachable URL
statusReason: expected 'http://localhost:19999' to be 'http://localhost:8080' // Object.is equality

[Killed] ObjectLiteral
src/services/openfga-client.ts:40:34
   async get(path: string): Promise<unknown> {
     const url = `${this.baseUrl}${path}`
     logger.debug({ url, method: 'GET' }, 'OpenFGA request')
-    const res = await fetch(url, { headers: this.headers() })
+    const res = await fetch(url, {})
     return this.handleResponse(res)
   }
killedBy: PUT /api/connection returns 400 for missing url
statusReason: fetch failed

[Killed] BlockStatement
src/services/openfga-client.ts:44:61
     return this.handleResponse(res)
   }
 
-  async post(path: string, body: unknown): Promise<unknown> {
-    const url = `${this.baseUrl}${path}`
-    logger.debug({ url, method: 'POST' }, 'OpenFGA request')
-    const res = await fetch(url, {
-      method: 'POST',
-      headers: this.headers(),
-      body: JSON.stringify(body),
-    })
-    return this.handleResponse(res)
-  }
+  async post(path: string, body: unknown): Promise<unknown> {}
 
   async delete(path: string, body?: unknown): Promise<unknown> {
killedBy: PUT /api/connection returns 400 for invalid url format
statusReason: fetch failed

[Killed] ObjectLiteral
src/services/openfga-client.ts:47:34
   async post(path: string, body: unknown): Promise<unknown> {
     const url = `${this.baseUrl}${path}`
     logger.debug({ url, method: 'POST' }, 'OpenFGA request')
-    const res = await fetch(url, {
-      method: 'POST',
-      headers: this.headers(),
-      body: JSON.stringify(body),
-    })
+    const res = await fetch(url, {})
     return this.handleResponse(res)
   }
killedBy: PUT /api/connection returns 400 for invalid url format
statusReason: fetch failed

[Killed] BlockStatement
src/services/openfga-client.ts:55:64
     return this.handleResponse(res)
   }
 
-  async delete(path: string, body?: unknown): Promise<unknown> {
-    const url = `${this.baseUrl}${path}`
-    logger.debug({ url, method: 'DELETE' }, 'OpenFGA request')
-    const res = await fetch(url, {
-      method: 'DELETE',
-      headers: this.headers(),
-      body: body ? JSON.stringify(body) : undefined,
-    })
-    return this.handleResponse(res)
-  }
+  async delete(path: string, body?: unknown): Promise<unknown> {}
 
   private async handleResponse(res: Response): Promise<unknown> {
killedBy: POST /api/connection/test returns 400 for missing url
statusReason: fetch failed

[Killed] ObjectLiteral
src/services/openfga-client.ts:58:34
   async delete(path: string, body?: unknown): Promise<unknown> {
     const url = `${this.baseUrl}${path}`
     logger.debug({ url, method: 'DELETE' }, 'OpenFGA request')
-    const res = await fetch(url, {
-      method: 'DELETE',
-      headers: this.headers(),
-      body: body ? JSON.stringify(body) : undefined,
-    })
+    const res = await fetch(url, {})
     return this.handleResponse(res)
   }
killedBy: PUT /api/connection returns 400 for invalid url format
statusReason: fetch failed

[Killed] StringLiteral
src/services/openfga-client.ts:59:15
     const url = `${this.baseUrl}${path}`
     logger.debug({ url, method: 'DELETE' }, 'OpenFGA request')
     const res = await fetch(url, {
-      method: 'DELETE',
+      method: "",
       headers: this.headers(),
       body: body ? JSON.stringify(body) : undefined,
killedBy: PUT /api/connection returns 400 for invalid url format
statusReason: fetch failed

[Killed] BlockStatement
src/services/openfga-client.ts:66:65
     return this.handleResponse(res)
   }
 
-  private async handleResponse(res: Response): Promise<unknown> {
-    const data = await res.json().catch(() => null)
-    if (!res.ok) {
-      const message = (data as Record<string, unknown>)?.message ?? res.statusText
-      const err = new Error(String(message))
-      ;(err as Error & { statusCode: number }).statusCode = res.status
-      ;(err as Error & { details: unknown }).details = data
-      throw err
-    }
-    return data
-  }
+  private async handleResponse(res: Response): Promise<unknown> {}
 
   async testConnection(url?: string): Promise<void> {
killedBy: openfgaClient throws with statusCode on non-ok response
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ArrowFunction
src/services/openfga-client.ts:67:41
   }
 
   private async handleResponse(res: Response): Promise<unknown> {
-    const data = await res.json().catch(() => null)
+    const data = await res.json().catch(() => undefined)
     if (!res.ok) {
       const message = (data as Record<string, unknown>)?.message ?? res.statusText
killedBy: PUT /api/connection returns 502 and reverts URL for unreachable URL
statusReason: fetch failed

[Killed] BooleanLiteral
src/services/openfga-client.ts:68:9
 
   private async handleResponse(res: Response): Promise<unknown> {
     const data = await res.json().catch(() => null)
-    if (!res.ok) {
+    if (res.ok) {
       const message = (data as Record<string, unknown>)?.message ?? res.statusText
       const err = new Error(String(message))
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Killed] BlockStatement
src/services/openfga-client.ts:68:18
 
   private async handleResponse(res: Response): Promise<unknown> {
     const data = await res.json().catch(() => null)
-    if (!res.ok) {
-      const message = (data as Record<string, unknown>)?.message ?? res.statusText
-      const err = new Error(String(message))
-      ;(err as Error & { statusCode: number }).statusCode = res.status
-      ;(err as Error & { details: unknown }).details = data
-      throw err
-    }
+    if (!res.ok) {}
     return data
   }
killedBy: openfgaClient throws with statusCode on non-ok response
statusReason: promise resolved "{ message: 'Store not found' }" instead of rejecting

[Killed] BlockStatement
src/services/openfga-client.ts:78:53
     return data
   }
 
-  async testConnection(url?: string): Promise<void> {
-    const targetUrl = url || this.baseUrl
-    const res = await fetch(`${targetUrl}/stores`, {
-      headers: this.headers(),
-    })
-    if (!res.ok) {
-      throw new Error(`Connection failed: ${res.status} ${res.statusText}`)
-    }
-  }
+  async testConnection(url?: string): Promise<void> {}
 }
 
killedBy: PUT /api/connection returns 400 for invalid url format
statusReason: fetch failed

[Killed] LogicalOperator
src/services/openfga-client.ts:79:23
   }
 
   async testConnection(url?: string): Promise<void> {
-    const targetUrl = url || this.baseUrl
+    const targetUrl = url && this.baseUrl
     const res = await fetch(`${targetUrl}/stores`, {
       headers: this.headers(),
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality
