[Killed] LogicalOperator
src/config.ts:4:18
 import 'dotenv/config'
 
 export const config = {
-  port: parseInt(process.env.PORT || '3000', 10),
+  port: parseInt(process.env.PORT && '3000', 10),
   openfga: {
     url: process.env.OPENFGA_URL || 'http://localhost:8080',
killedBy: GET /api/connection returns connection status without API key
statusReason: expected { status: 'connected' } to have property "url"

[Killed] ConditionalExpression
src/config.ts:4:18
 import 'dotenv/config'
 
 export const config = {
-  port: parseInt(process.env.PORT || '3000', 10),
+  port: parseInt(true, 10),
   openfga: {
     url: process.env.OPENFGA_URL || 'http://localhost:8080',
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/config.ts:6:10
 export const config = {
   port: parseInt(process.env.PORT || '3000', 10),
   openfga: {
-    url: process.env.OPENFGA_URL || 'http://localhost:8080',
+    url: false,
     apiKey: process.env.OPENFGA_API_KEY || '',
     storeId: process.env.OPENFGA_STORE_ID || '',
killedBy: PUT /api/connection returns 502 and reverts URL for unreachable URL
statusReason: fetch failed

[Killed] ConditionalExpression
src/config.ts:8:14
   openfga: {
     url: process.env.OPENFGA_URL || 'http://localhost:8080',
     apiKey: process.env.OPENFGA_API_KEY || '',
-    storeId: process.env.OPENFGA_STORE_ID || '',
+    storeId: false,
   },
 }
killedBy: GET /api/connection returns connection status without API key
statusReason: fetch failed
