[Killed] BlockStatement
src/services/model-service.ts:11:73
   transformer: { transformJSONStringToDSL: (json: string) => string }
 }).transformer
 
-export async function getModel(storeId: string): Promise<ModelResponse> {
-  const data = await openfgaClient.get(
-    `/stores/${storeId}/authorization-models?page_size=1`,
-  ) as ListAuthorizationModelsResponse
-
-  const models = data.authorization_models ?? []
-  if (models.length === 0) {
-    return { json: null, dsl: null, authorizationModelId: null }
-  }
-
-  const model: AuthorizationModel = models[0]
-
-  let dsl: string | null = null
-  try {
-    dsl = transformJSONStringToDSL(JSON.stringify(model))
-  } catch (err) {
-    logger.warn({ err, modelId: model.id }, 'DSL conversion failed')
-  }
-
-  return { json: model, dsl, authorizationModelId: model.id }
-}
+export async function getModel(storeId: string): Promise<ModelResponse> {}
 
killedBy: PUT /api/connection returns 502 and reverts URL for unreachable URL
statusReason: fetch failed

[Killed] LogicalOperator
src/services/model-service.ts:16:18
     `/stores/${storeId}/authorization-models?page_size=1`,
   ) as ListAuthorizationModelsResponse
 
-  const models = data.authorization_models ?? []
+  const models = data.authorization_models && []
   if (models.length === 0) {
     return { json: null, dsl: null, authorizationModelId: null }
killedBy: PUT /api/connection returns 502 and reverts URL for unreachable URL
statusReason: fetch failed

[Killed] ArrayDeclaration
src/services/model-service.ts:16:47
     `/stores/${storeId}/authorization-models?page_size=1`,
   ) as ListAuthorizationModelsResponse
 
-  const models = data.authorization_models ?? []
+  const models = data.authorization_models ?? ["Stryker was here"]
   if (models.length === 0) {
     return { json: null, dsl: null, authorizationModelId: null }
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Killed] EqualityOperator
src/services/model-service.ts:17:7
   ) as ListAuthorizationModelsResponse
 
   const models = data.authorization_models ?? []
-  if (models.length === 0) {
+  if (models.length !== 0) {
     return { json: null, dsl: null, authorizationModelId: null }
   }
killedBy: PUT /api/connection returns 400 for missing url
statusReason: fetch failed

[Killed] ConditionalExpression
src/services/model-service.ts:17:7
   ) as ListAuthorizationModelsResponse
 
   const models = data.authorization_models ?? []
-  if (models.length === 0) {
+  if (true) {
     return { json: null, dsl: null, authorizationModelId: null }
   }
killedBy: getModel returns json, dsl, and authorizationModelId when model exists and transformer succeeds
statusReason: expected null to be 'model-01' // Object.is equality

[Killed] BlockStatement
src/services/model-service.ts:24:7
   const model: AuthorizationModel = models[0]
 
   let dsl: string | null = null
-  try {
-    dsl = transformJSONStringToDSL(JSON.stringify(model))
-  } catch (err) {
+  try {} catch (err) {
     logger.warn({ err, modelId: model.id }, 'DSL conversion failed')
   }
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Killed] BlockStatement
src/services/model-service.ts:26:17
   let dsl: string | null = null
   try {
     dsl = transformJSONStringToDSL(JSON.stringify(model))
-  } catch (err) {
-    logger.warn({ err, modelId: model.id }, 'DSL conversion failed')
-  }
+  } catch (err) {}
 
   return { json: model, dsl, authorizationModelId: model.id }
killedBy: GET /api/connection returns connection status without API key
statusReason: fetch failed
