[Killed] BlockStatement
src/middleware/validate.ts:4:43
 import type { Request, Response, NextFunction } from 'express'
 import type { ZodType } from 'zod'
 
-export function validate(schema: ZodType) {
-  return (req: Request, res: Response, next: NextFunction): void => {
-    const result = schema.safeParse(req.body)
-    if (!result.success) {
-      res.status(400).json({
-        error: 'Validation error',
-        details: result.error.issues,
-      })
-      return
-    }
-    req.body = result.data
-    next()
-  }
-}
+export function validate(schema: ZodType) {}
 
killedBy: validate middleware calls next() for valid body
statusReason: validate(...) is not a function

[Killed] BlockStatement
src/middleware/validate.ts:5:69
 import type { ZodType } from 'zod'
 
 export function validate(schema: ZodType) {
-  return (req: Request, res: Response, next: NextFunction): void => {
-    const result = schema.safeParse(req.body)
-    if (!result.success) {
-      res.status(400).json({
-        error: 'Validation error',
-        details: result.error.issues,
-      })
-      return
-    }
-    req.body = result.data
-    next()
-  }
+  return (req: Request, res: Response, next: NextFunction): void => {}
 }
 
killedBy: POST /api/stores creates a store and returns 201
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/middleware/validate.ts:7:9
 export function validate(schema: ZodType) {
   return (req: Request, res: Response, next: NextFunction): void => {
     const result = schema.safeParse(req.body)
-    if (!result.success) {
+    if (true) {
       res.status(400).json({
         error: 'Validation error',
killedBy: GET /api/connection returns connection status without API key
statusReason: fetch failed

[Killed] ConditionalExpression
src/middleware/validate.ts:7:9
 export function validate(schema: ZodType) {
   return (req: Request, res: Response, next: NextFunction): void => {
     const result = schema.safeParse(req.body)
-    if (!result.success) {
+    if (false) {
       res.status(400).json({
         error: 'Validation error',
killedBy: POST /api/connection/test returns 400 for missing url
statusReason: expected 500 to be 400 // Object.is equality
