[Killed] BlockStatement
src/services/openfga-client.ts:9:17
   private apiKey: string
   public storeId: string
 
-  constructor() {
-    this.baseUrl = config.openfga.url
-    this.apiKey = config.openfga.apiKey
-    this.storeId = config.openfga.storeId
-  }
+  constructor() {}
 
   get url(): string {
killedBy: GET /api/connection returns connection status without API key
statusReason: expected { status: 'connected' } to have property "url"

[Killed] BlockStatement
src/services/openfga-client.ts:15:21
     this.storeId = config.openfga.storeId
   }
 
-  get url(): string {
-    return this.baseUrl
-  }
+  get url(): string {}
 
   updateUrl(url: string): void {
killedBy: GET /api/connection returns connection status without API key
statusReason: expected { storeId: '', status: 'connected' } to have property "url"

[Killed] BlockStatement
src/services/openfga-client.ts:19:32
     return this.baseUrl
   }
 
-  updateUrl(url: string): void {
-    this.baseUrl = url
-  }
+  updateUrl(url: string): void {}
 
   updateApiKey(apiKey: string): void {
killedBy: openfgaClient supports mutable URL update
statusReason: expected 'http://test-openfga:8080' to be 'http://new-host:9090' // Object.is equality

[Survived] BlockStatement
src/services/openfga-client.ts:23:38
     this.baseUrl = url
   }
 
-  updateApiKey(apiKey: string): void {
-    this.apiKey = apiKey
-  }
+  updateApiKey(apiKey: string): void {}
 
   private headers(): Record<string, string> {

[Killed] BlockStatement
src/services/openfga-client.ts:27:45
     this.apiKey = apiKey
   }
 
-  private headers(): Record<string, string> {
-    const h: Record<string, string> = {
-      'Content-Type': 'application/json',
-    }
-    if (this.apiKey) {
-      h['Authorization'] = `Bearer ${this.apiKey}`
-    }
-    return h
-  }
+  private headers(): Record<string, string> {}
 
   async get(path: string): Promise<unknown> {
killedBy: PUT /api/connection returns 502 and reverts URL for unreachable URL
statusReason: fetch failed

[Killed] BlockStatement
src/services/openfga-client.ts:31:22
     const h: Record<string, string> = {
       'Content-Type': 'application/json',
     }
-    if (this.apiKey) {
-      h['Authorization'] = `Bearer ${this.apiKey}`
-    }
+    if (this.apiKey) {}
     return h
   }
killedBy: openfgaClient injects Authorization header on GET
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "http://test-openfga:8080/stores",

[Killed] ConditionalExpression
src/services/openfga-client.ts:31:9
     const h: Record<string, string> = {
       'Content-Type': 'application/json',
     }
-    if (this.apiKey) {
+    if (false) {
       h['Authorization'] = `Bearer ${this.apiKey}`
     }
killedBy: GET /api/stores/:storeId/model returns 200 with model data when model exists
statusReason: expected null to be 'model-01' // Object.is equality

[Killed] BlockStatement
src/services/openfga-client.ts:37:45
     return h
   }
 
-  async get(path: string): Promise<unknown> {
-    const url = `${this.baseUrl}${path}`
-    logger.debug({ url, method: 'GET' }, 'OpenFGA request')
-    const res = await fetch(url, { headers: this.headers(), signal: AbortSignal.timeout(5000) })
-    return this.handleResponse(res)
-  }
+  async get(path: string): Promise<unknown> {}
 
   async post(path: string, body: unknown): Promise<unknown> {
killedBy: openfgaClient injects Authorization header on GET
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] StringLiteral
src/services/openfga-client.ts:38:17
   }
 
   async get(path: string): Promise<unknown> {
-    const url = `${this.baseUrl}${path}`
+    const url = ``
     logger.debug({ url, method: 'GET' }, 'OpenFGA request')
     const res = await fetch(url, { headers: this.headers(), signal: AbortSignal.timeout(5000) })
killedBy: PUT /api/connection returns 502 and reverts URL for unreachable URL
statusReason: fetch failed

[Killed] ObjectLiteral
src/services/openfga-client.ts:40:34
   async get(path: string): Promise<unknown> {
     const url = `${this.baseUrl}${path}`
     logger.debug({ url, method: 'GET' }, 'OpenFGA request')
-    const res = await fetch(url, { headers: this.headers(), signal: AbortSignal.timeout(5000) })
+    const res = await fetch(url, {})
     return this.handleResponse(res)
   }
killedBy: openfgaClient injects Authorization header on GET
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "http://test-openfga:8080/stores",

[Killed] BlockStatement
src/services/openfga-client.ts:44:61
     return this.handleResponse(res)
   }
 
-  async post(path: string, body: unknown): Promise<unknown> {
-    const url = `${this.baseUrl}${path}`
-    logger.debug({ url, method: 'POST' }, 'OpenFGA request')
-    const res = await fetch(url, {
-      method: 'POST',
-      headers: this.headers(),
-      body: JSON.stringify(body),
-      signal: AbortSignal.timeout(5000),
-    })
-    return this.handleResponse(res)
-  }
+  async post(path: string, body: unknown): Promise<unknown> {}
 
   async delete(path: string, body?: unknown): Promise<unknown> {
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/services/openfga-client.ts:46:18
 
   async post(path: string, body: unknown): Promise<unknown> {
     const url = `${this.baseUrl}${path}`
-    logger.debug({ url, method: 'POST' }, 'OpenFGA request')
+    logger.debug({}, 'OpenFGA request')
     const res = await fetch(url, {
       method: 'POST',
killedBy: PUT /api/connection returns 502 and reverts URL for unreachable URL
statusReason: fetch failed

[Killed] ObjectLiteral
src/services/openfga-client.ts:47:34
   async post(path: string, body: unknown): Promise<unknown> {
     const url = `${this.baseUrl}${path}`
     logger.debug({ url, method: 'POST' }, 'OpenFGA request')
-    const res = await fetch(url, {
-      method: 'POST',
-      headers: this.headers(),
-      body: JSON.stringify(body),
-      signal: AbortSignal.timeout(5000),
-    })
+    const res = await fetch(url, {})
     return this.handleResponse(res)
   }
killedBy: openfgaClient injects Authorization header on POST with body
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "http://test-openfga:8080/stores",

[Survived] BlockStatement
src/services/openfga-client.ts:56:64
     return this.handleResponse(res)
   }
 
-  async delete(path: string, body?: unknown): Promise<unknown> {
-    const url = `${this.baseUrl}${path}`
-    logger.debug({ url, method: 'DELETE' }, 'OpenFGA request')
-    const res = await fetch(url, {
-      method: 'DELETE',
-      headers: this.headers(),
-      body: body ? JSON.stringify(body) : undefined,
-      signal: AbortSignal.timeout(5000),
-    })
-    return this.handleResponse(res)
-  }
+  async delete(path: string, body?: unknown): Promise<unknown> {}
 
   private async handleResponse(res: Response): Promise<unknown> {

[Killed] StringLiteral
src/services/openfga-client.ts:57:17
   }
 
   async delete(path: string, body?: unknown): Promise<unknown> {
-    const url = `${this.baseUrl}${path}`
+    const url = ``
     logger.debug({ url, method: 'DELETE' }, 'OpenFGA request')
     const res = await fetch(url, {
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Killed] StringLiteral
src/services/openfga-client.ts:58:45
 
   async delete(path: string, body?: unknown): Promise<unknown> {
     const url = `${this.baseUrl}${path}`
-    logger.debug({ url, method: 'DELETE' }, 'OpenFGA request')
+    logger.debug({ url, method: 'DELETE' }, "")
     const res = await fetch(url, {
       method: 'DELETE',
killedBy: GET /api/stores/:storeId/model returns 500 when OpenFGA is unreachable
statusReason: expected 404 to be 503 // Object.is equality

[Survived] StringLiteral
src/services/openfga-client.ts:58:33
 
   async delete(path: string, body?: unknown): Promise<unknown> {
     const url = `${this.baseUrl}${path}`
-    logger.debug({ url, method: 'DELETE' }, 'OpenFGA request')
+    logger.debug({ url, method: "" }, 'OpenFGA request')
     const res = await fetch(url, {
       method: 'DELETE',

[Killed] BlockStatement
src/services/openfga-client.ts:68:65
     return this.handleResponse(res)
   }
 
-  private async handleResponse(res: Response): Promise<unknown> {
-    const data = res.status === 204 ? null : await res.json().catch(() => null)
-    if (!res.ok) {
-      const message = (data as Record<string, unknown>)?.message ?? res.statusText
-      const err = new Error(String(message))
-      ;(err as Error & { statusCode: number }).statusCode = res.status
-      ;(err as Error & { details: unknown }).details = data
-      throw err
-    }
-    return data
-  }
+  private async handleResponse(res: Response): Promise<unknown> {}
 
   async testConnection(url?: string): Promise<void> {
killedBy: openfgaClient throws with statusCode on non-ok response
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ArrowFunction
src/services/openfga-client.ts:69:69
   }
 
   private async handleResponse(res: Response): Promise<unknown> {
-    const data = res.status === 204 ? null : await res.json().catch(() => null)
+    const data = res.status === 204 ? null : await res.json().catch(() => undefined)
     if (!res.ok) {
       const message = (data as Record<string, unknown>)?.message ?? res.statusText
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Killed] EqualityOperator
src/services/openfga-client.ts:69:18
   }
 
   private async handleResponse(res: Response): Promise<unknown> {
-    const data = res.status === 204 ? null : await res.json().catch(() => null)
+    const data = res.status !== 204 ? null : await res.json().catch(() => null)
     if (!res.ok) {
       const message = (data as Record<string, unknown>)?.message ?? res.statusText
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/services/openfga-client.ts:70:9
 
   private async handleResponse(res: Response): Promise<unknown> {
     const data = res.status === 204 ? null : await res.json().catch(() => null)
-    if (!res.ok) {
+    if (true) {
       const message = (data as Record<string, unknown>)?.message ?? res.statusText
       const err = new Error(String(message))
killedBy: openfgaClient injects Authorization header on GET
statusReason: undefined

[Killed] BlockStatement
src/services/openfga-client.ts:70:18
 
   private async handleResponse(res: Response): Promise<unknown> {
     const data = res.status === 204 ? null : await res.json().catch(() => null)
-    if (!res.ok) {
-      const message = (data as Record<string, unknown>)?.message ?? res.statusText
-      const err = new Error(String(message))
-      ;(err as Error & { statusCode: number }).statusCode = res.status
-      ;(err as Error & { details: unknown }).details = data
-      throw err
-    }
+    if (!res.ok) {}
     return data
   }
killedBy: openfgaClient throws with statusCode on non-ok response
statusReason: promise resolved "{ message: 'Store not found' }" instead of rejecting

[Killed] OptionalChaining
src/services/openfga-client.ts:71:23
   private async handleResponse(res: Response): Promise<unknown> {
     const data = res.status === 204 ? null : await res.json().catch(() => null)
     if (!res.ok) {
-      const message = (data as Record<string, unknown>)?.message ?? res.statusText
+      const message = (data as Record<string, unknown>).message ?? res.statusText
       const err = new Error(String(message))
       ;(err as Error & { statusCode: number }).statusCode = res.status
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/services/openfga-client.ts:71:23
   private async handleResponse(res: Response): Promise<unknown> {
     const data = res.status === 204 ? null : await res.json().catch(() => null)
     if (!res.ok) {
-      const message = (data as Record<string, unknown>)?.message ?? res.statusText
+      const message = (data as Record<string, unknown>)?.message && res.statusText
       const err = new Error(String(message))
       ;(err as Error & { statusCode: number }).statusCode = res.status
killedBy: openfgaClient throws with statusCode on non-ok response
statusReason: expected [Function] to throw error including 'Store not found' but got 'Not Found'

[Killed] BlockStatement
src/services/openfga-client.ts:80:53
     return data
   }
 
-  async testConnection(url?: string): Promise<void> {
-    const targetUrl = url || this.baseUrl
-    const res = await fetch(`${targetUrl}/stores`, {
-      headers: this.headers(),
-      signal: AbortSignal.timeout(5000),
-    })
-    if (!res.ok) {
-      throw new Error(`Connection failed: ${res.status} ${res.statusText}`)
-    }
-  }
+  async testConnection(url?: string): Promise<void> {}
 }
 
killedBy: POST /api/connection/test returns 502 for unreachable URL
statusReason: expected 200 to be 502 // Object.is equality

[Killed] ConditionalExpression
src/services/openfga-client.ts:81:23
   }
 
   async testConnection(url?: string): Promise<void> {
-    const targetUrl = url || this.baseUrl
+    const targetUrl = true
     const res = await fetch(`${targetUrl}/stores`, {
       headers: this.headers(),
killedBy: openfgaClient testConnection calls /stores on target URL
statusReason: expected "vi.fn()" to be called with arguments: [ 'http://other:8080/stores', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "http://other:8080/stores",

[Killed] ConditionalExpression
src/services/openfga-client.ts:81:23
   }
 
   async testConnection(url?: string): Promise<void> {
-    const targetUrl = url || this.baseUrl
+    const targetUrl = false
     const res = await fetch(`${targetUrl}/stores`, {
       headers: this.headers(),
killedBy: openfgaClient testConnection calls /stores on target URL
statusReason: expected "vi.fn()" to be called with arguments: [ 'http://other:8080/stores', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "http://other:8080/stores",

[Killed] ObjectLiteral
src/services/openfga-client.ts:82:52
 
   async testConnection(url?: string): Promise<void> {
     const targetUrl = url || this.baseUrl
-    const res = await fetch(`${targetUrl}/stores`, {
-      headers: this.headers(),
-      signal: AbortSignal.timeout(5000),
-    })
+    const res = await fetch(`${targetUrl}/stores`, {})
     if (!res.ok) {
       throw new Error(`Connection failed: ${res.status} ${res.statusText}`)
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Killed] StringLiteral
src/services/openfga-client.ts:82:29
 
   async testConnection(url?: string): Promise<void> {
     const targetUrl = url || this.baseUrl
-    const res = await fetch(`${targetUrl}/stores`, {
+    const res = await fetch(``, {
       headers: this.headers(),
       signal: AbortSignal.timeout(5000),
killedBy: PUT /api/connection returns 400 for missing url
statusReason: fetch failed

[Killed] ConditionalExpression
src/services/openfga-client.ts:86:9
       headers: this.headers(),
       signal: AbortSignal.timeout(5000),
     })
-    if (!res.ok) {
+    if (true) {
       throw new Error(`Connection failed: ${res.status} ${res.statusText}`)
     }
killedBy: openfgaClient testConnection calls /stores on target URL
statusReason: Connection failed: undefined undefined
