[Killed] BlockStatement
src/routes/connection.ts:16:89
   })
 })
 
-router.post('/api/connection/test', validate(testConnectionSchema), async (req, res) => {
-  const { url } = req.body as { url: string }
-  try {
-    await openfgaClient.testConnection(url)
-    res.json({ status: 'connected' })
-  } catch (err) {
-    res.status(502).json({
-      error: 'Connection failed',
-      details: (err as Error).message,
-    })
-  }
-})
+router.post('/api/connection/test', validate(testConnectionSchema), async (req, res) => {})
 
 router.put('/api/connection', validate(updateConnectionSchema), async (req, res) => {
killedBy: POST /api/connection/test returns 400 for missing url
statusReason: expected 404 to be 400 // Object.is equality

[Killed] BlockStatement
src/routes/connection.ts:21:17
   try {
     await openfgaClient.testConnection(url)
     res.json({ status: 'connected' })
-  } catch (err) {
-    res.status(502).json({
-      error: 'Connection failed',
-      details: (err as Error).message,
-    })
-  }
+  } catch (err) {}
 })
 
killedBy: POST /api/connection/test returns 502 for unreachable URL
statusReason: fetch failed

[Killed] BlockStatement
src/routes/connection.ts:29:85
   }
 })
 
-router.put('/api/connection', validate(updateConnectionSchema), async (req, res) => {
-  const { url } = req.body as { url: string }
-  const previousUrl = openfgaClient.url
-  openfgaClient.updateUrl(url)
-  try {
-    await openfgaClient.testConnection()
-    res.json({
-      url: openfgaClient.url,
-      storeId: openfgaClient.storeId,
-      status: 'connected',
-    })
-  } catch (err) {
-    openfgaClient.updateUrl(previousUrl)
-    res.status(502).json({
-      error: 'Connection failed',
-      details: (err as Error).message,
-    })
-  }
-})
+router.put('/api/connection', validate(updateConnectionSchema), async (req, res) => {})
 
 export default router
killedBy: POST /api/connection/test returns 502 for unreachable URL
statusReason: fetch failed

[Killed] BlockStatement
src/routes/connection.ts:33:7
   const { url } = req.body as { url: string }
   const previousUrl = openfgaClient.url
   openfgaClient.updateUrl(url)
-  try {
-    await openfgaClient.testConnection()
-    res.json({
-      url: openfgaClient.url,
-      storeId: openfgaClient.storeId,
-      status: 'connected',
-    })
-  } catch (err) {
+  try {} catch (err) {
     openfgaClient.updateUrl(previousUrl)
     res.status(502).json({
killedBy: POST /api/connection/test returns 502 for unreachable URL
statusReason: fetch failed

[Killed] BlockStatement
src/routes/connection.ts:40:17
       storeId: openfgaClient.storeId,
       status: 'connected',
     })
-  } catch (err) {
-    openfgaClient.updateUrl(previousUrl)
-    res.status(502).json({
-      error: 'Connection failed',
-      details: (err as Error).message,
-    })
-  }
+  } catch (err) {}
 })
 
killedBy: PUT /api/connection returns 400 for missing url
statusReason: fetch failed
