[Killed] BooleanLiteral
src/stores/model.ts:14:32
 export const useModelStore = defineStore('model', () => {
   const api = useApi()
 
-  const loading = ref<boolean>(false)
+  const loading = ref<boolean>(true)
   const error = ref<string | null>(null)
   const dsl = ref<string | null>(null)
killedBy: useModelStore initial state has null values and loading false
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/model.ts:20:46
   const json = ref<object | null>(null)
   const authorizationModelId = ref<string | null>(null)
 
-  async function fetchModel(storeId: string) {
-    loading.value = true
-    error.value = null
-    try {
-      const data = await api.get<ModelResponse>(`stores/${storeId}/model`)
-      dsl.value = data.dsl
-      json.value = data.json
-      authorizationModelId.value = data.authorizationModelId
-    } catch (err) {
-      error.value = (err as Error).message
-      dsl.value = null
-      json.value = null
-      authorizationModelId.value = null
-    } finally {
-      loading.value = false
-    }
-  }
+  async function fetchModel(storeId: string) {}
 
   function reset() {
killedBy: useModelStore fetchModel populates dsl, json, authorizationModelId on success
statusReason: expected null to be 'model\n  schema 1.1' // Object.is equality

[Killed] BooleanLiteral
src/stores/model.ts:21:21
   const authorizationModelId = ref<string | null>(null)
 
   async function fetchModel(storeId: string) {
-    loading.value = true
+    loading.value = false
     error.value = null
     try {
killedBy: ModelViewer shows LoadingSpinner when modelStore.loading is true
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/model.ts:23:9
   async function fetchModel(storeId: string) {
     loading.value = true
     error.value = null
-    try {
-      const data = await api.get<ModelResponse>(`stores/${storeId}/model`)
-      dsl.value = data.dsl
-      json.value = data.json
-      authorizationModelId.value = data.authorizationModelId
-    } catch (err) {
+    try {} catch (err) {
       error.value = (err as Error).message
       dsl.value = null
killedBy: ModelViewer shows LoadingSpinner when modelStore.loading is true
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/model.ts:28:19
       dsl.value = data.dsl
       json.value = data.json
       authorizationModelId.value = data.authorizationModelId
-    } catch (err) {
-      error.value = (err as Error).message
-      dsl.value = null
-      json.value = null
-      authorizationModelId.value = null
-    } finally {
+    } catch (err) {} finally {
       loading.value = false
     }
killedBy: useModelStore fetchModel sets error and nulls data on failure
statusReason: expected null to be 'Store not found' // Object.is equality

[Killed] BlockStatement
src/stores/model.ts:33:15
       dsl.value = null
       json.value = null
       authorizationModelId.value = null
-    } finally {
-      loading.value = false
-    }
+    } finally {}
   }
 
killedBy: ModelViewer shows ModelDslView when loading is false and dsl tab is active
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/model.ts:38:20
     }
   }
 
-  function reset() {
-    loading.value = false
-    error.value = null
-    dsl.value = null
-    json.value = null
-    authorizationModelId.value = null
-  }
+  function reset() {}
 
   return {
killedBy: useModelStore reset() clears all state
statusReason: expected 'some dsl' to be null

[Killed] BooleanLiteral
src/stores/model.ts:39:21
   }
 
   function reset() {
-    loading.value = false
+    loading.value = true
     error.value = null
     dsl.value = null
killedBy: useModelStore reset() clears all state
statusReason: expected true to be false // Object.is equality
