[Killed] BlockStatement
src/app.ts:11:39
 
 app.use(express.json())
 
-app.get('/api/health', (_req, res) => {
-  res.json({ status: 'ok' })
-})
+app.get('/api/health', (_req, res) => {})
 
 app.use(connectionRoutes)
killedBy: GET /api/connection returns connection status without API key
statusReason: fetch failed

[Killed] StringLiteral
src/app.ts:17:9
 
 app.use(connectionRoutes)
 app.use(storesRoutes)
-app.use('/api/stores/:storeId/model', modelRouter)
+app.use("", modelRouter)
 
 app.use(errorHandler)
killedBy: GET /api/stores/:storeId/model returns 200 with model data when model exists
statusReason: expected 404 to be 200 // Object.is equality
