[Killed] BlockStatement
src/config.ts:4:16
 import 'dotenv/config'
 
 export const config = {
-  port: (() => {
-    const p = parseInt(process.env.PORT || '3000', 10)
-    if (isNaN(p)) throw new Error(`Invalid PORT env var: "${process.env.PORT}"`)
-    return p
-  })(),
+  port: (() => {})(),
   openfga: {
     url: process.env.OPENFGA_URL || 'http://localhost:8080',
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/config.ts:5:24
 
 export const config = {
   port: (() => {
-    const p = parseInt(process.env.PORT || '3000', 10)
+    const p = parseInt(false, 10)
     if (isNaN(p)) throw new Error(`Invalid PORT env var: "${process.env.PORT}"`)
     return p
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: fetch failed

[Killed] ConditionalExpression
src/config.ts:5:24
 
 export const config = {
   port: (() => {
-    const p = parseInt(process.env.PORT || '3000', 10)
+    const p = parseInt(true, 10)
     if (isNaN(p)) throw new Error(`Invalid PORT env var: "${process.env.PORT}"`)
     return p
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/config.ts:6:9
 export const config = {
   port: (() => {
     const p = parseInt(process.env.PORT || '3000', 10)
-    if (isNaN(p)) throw new Error(`Invalid PORT env var: "${process.env.PORT}"`)
+    if (false) throw new Error(`Invalid PORT env var: "${process.env.PORT}"`)
     return p
   })(),
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Survived] ConditionalExpression
src/config.ts:6:9
 export const config = {
   port: (() => {
     const p = parseInt(process.env.PORT || '3000', 10)
-    if (isNaN(p)) throw new Error(`Invalid PORT env var: "${process.env.PORT}"`)
+    if (true) throw new Error(`Invalid PORT env var: "${process.env.PORT}"`)
     return p
   })(),

[Killed] LogicalOperator
src/config.ts:10:10
     return p
   })(),
   openfga: {
-    url: process.env.OPENFGA_URL || 'http://localhost:8080',
+    url: process.env.OPENFGA_URL && 'http://localhost:8080',
     apiKey: process.env.OPENFGA_API_KEY || '',
     storeId: process.env.OPENFGA_STORE_ID || '',
killedBy: GET /api/connection returns connection status without API key
statusReason: expected { storeId: '', status: 'connected' } to have property "url"

[Survived] ConditionalExpression
src/config.ts:10:10
     return p
   })(),
   openfga: {
-    url: process.env.OPENFGA_URL || 'http://localhost:8080',
+    url: true,
     apiKey: process.env.OPENFGA_API_KEY || '',
     storeId: process.env.OPENFGA_STORE_ID || '',

[Killed] LogicalOperator
src/config.ts:11:13
   })(),
   openfga: {
     url: process.env.OPENFGA_URL || 'http://localhost:8080',
-    apiKey: process.env.OPENFGA_API_KEY || '',
+    apiKey: process.env.OPENFGA_API_KEY && '',
     storeId: process.env.OPENFGA_STORE_ID || '',
   },
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/config.ts:11:13
   })(),
   openfga: {
     url: process.env.OPENFGA_URL || 'http://localhost:8080',
-    apiKey: process.env.OPENFGA_API_KEY || '',
+    apiKey: true,
     storeId: process.env.OPENFGA_STORE_ID || '',
   },
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: fetch failed

[Killed] LogicalOperator
src/config.ts:12:14
   openfga: {
     url: process.env.OPENFGA_URL || 'http://localhost:8080',
     apiKey: process.env.OPENFGA_API_KEY || '',
-    storeId: process.env.OPENFGA_STORE_ID || '',
+    storeId: process.env.OPENFGA_STORE_ID && '',
   },
 }
killedBy: GET /api/connection returns connection status without API key
statusReason: expected { url: 'http://localhost:8080', …(1) } to have property "storeId"

[Survived] ConditionalExpression
src/config.ts:12:14
   openfga: {
     url: process.env.OPENFGA_URL || 'http://localhost:8080',
     apiKey: process.env.OPENFGA_API_KEY || '',
-    storeId: process.env.OPENFGA_STORE_ID || '',
+    storeId: true,
   },
 }
