[Killed] BlockStatement
src/middleware/error-handler.ts:9:101
   details?: unknown
 }
 
-export function errorHandler(err: AppError, req: Request, res: Response, _next: NextFunction): void {
-  const statusCode = err.statusCode || 500
-  const message = err.message || 'Internal server error'
-
-  logger.error(
-    { err: { message, stack: err.stack }, req: { method: req.method, url: req.url } },
-    'Request failed',
-  )
-
-  res.status(statusCode).json({
-    error: message,
-    ...(err.details ? { details: err.details } : {}),
-  })
-}
+export function errorHandler(err: AppError, req: Request, res: Response, _next: NextFunction): void {}
 
killedBy: GET /api/stores returns 500 when OpenFGA is unreachable
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/middleware/error-handler.ts:10:22
 }
 
 export function errorHandler(err: AppError, req: Request, res: Response, _next: NextFunction): void {
-  const statusCode = err.statusCode || 500
+  const statusCode = false
   const message = err.message || 'Internal server error'
 
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: fetch failed

[Killed] ConditionalExpression
src/middleware/error-handler.ts:10:22
 }
 
 export function errorHandler(err: AppError, req: Request, res: Response, _next: NextFunction): void {
-  const statusCode = err.statusCode || 500
+  const statusCode = true
   const message = err.message || 'Internal server error'
 
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: fetch failed

[Killed] ConditionalExpression
src/middleware/error-handler.ts:11:19
 
 export function errorHandler(err: AppError, req: Request, res: Response, _next: NextFunction): void {
   const statusCode = err.statusCode || 500
-  const message = err.message || 'Internal server error'
+  const message = true
 
   logger.error(
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: fetch failed

[Killed] LogicalOperator
src/middleware/error-handler.ts:11:19
 
 export function errorHandler(err: AppError, req: Request, res: Response, _next: NextFunction): void {
   const statusCode = err.statusCode || 500
-  const message = err.message || 'Internal server error'
+  const message = err.message && 'Internal server error'
 
   logger.error(
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: fetch failed

[Killed] ObjectLiteral
src/middleware/error-handler.ts:14:12
   const message = err.message || 'Internal server error'
 
   logger.error(
-    { err: { message, stack: err.stack }, req: { method: req.method, url: req.url } },
+    { err: {}, req: { method: req.method, url: req.url } },
     'Request failed',
   )
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/middleware/error-handler.ts:20:23
 
   res.status(statusCode).json({
     error: message,
-    ...(err.details ? { details: err.details } : {}),
+    ...(err.details ? {} : {}),
   })
 }
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality
