[Killed] BlockStatement
src/middleware/validate.ts:4:89
 import type { Request, Response, NextFunction } from 'express'
 import type { ZodType } from 'zod'
 
-export function validate(schema: ZodType, target: 'body' | 'params' | 'query' = 'body') {
-  return (req: Request, res: Response, next: NextFunction): void => {
-    const data = target === 'params' ? req.params : target === 'query' ? req.query : req.body
-    const result = schema.safeParse(data)
-    if (!result.success) {
-      res.status(400).json({
-        error: 'Validation error',
-        details: result.error.issues,
-      })
-      return
-    }
-    if (target === 'body') req.body = result.data
-    next()
-  }
-}
+export function validate(schema: ZodType, target: 'body' | 'params' | 'query' = 'body') {}
 
killedBy: validate middleware calls next() for valid body
statusReason: validate(...) is not a function

[Killed] BlockStatement
src/middleware/validate.ts:5:69
 import type { ZodType } from 'zod'
 
 export function validate(schema: ZodType, target: 'body' | 'params' | 'query' = 'body') {
-  return (req: Request, res: Response, next: NextFunction): void => {
-    const data = target === 'params' ? req.params : target === 'query' ? req.query : req.body
-    const result = schema.safeParse(data)
-    if (!result.success) {
-      res.status(400).json({
-        error: 'Validation error',
-        details: result.error.issues,
-      })
-      return
-    }
-    if (target === 'body') req.body = result.data
-    next()
-  }
+  return (req: Request, res: Response, next: NextFunction): void => {}
 }
 
killedBy: POST /api/connection/test returns 400 for missing url
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/middleware/validate.ts:6:53
 
 export function validate(schema: ZodType, target: 'body' | 'params' | 'query' = 'body') {
   return (req: Request, res: Response, next: NextFunction): void => {
-    const data = target === 'params' ? req.params : target === 'query' ? req.query : req.body
+    const data = target === 'params' ? req.params : target !== 'query' ? req.query : req.body
     const result = schema.safeParse(data)
     if (!result.success) {
killedBy: POST /api/connection/test returns 400 for missing url
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/middleware/validate.ts:6:53
 
 export function validate(schema: ZodType, target: 'body' | 'params' | 'query' = 'body') {
   return (req: Request, res: Response, next: NextFunction): void => {
-    const data = target === 'params' ? req.params : target === 'query' ? req.query : req.body
+    const data = target === 'params' ? req.params : false ? req.query : req.body
     const result = schema.safeParse(data)
     if (!result.success) {
killedBy: POST /api/connection/test returns 400 for missing url
statusReason: fetch failed

[Killed] ConditionalExpression
src/middleware/validate.ts:8:9
   return (req: Request, res: Response, next: NextFunction): void => {
     const data = target === 'params' ? req.params : target === 'query' ? req.query : req.body
     const result = schema.safeParse(data)
-    if (!result.success) {
+    if (false) {
       res.status(400).json({
         error: 'Validation error',
killedBy: POST /api/connection/test returns 400 for missing url
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
src/middleware/validate.ts:8:26
   return (req: Request, res: Response, next: NextFunction): void => {
     const data = target === 'params' ? req.params : target === 'query' ? req.query : req.body
     const result = schema.safeParse(data)
-    if (!result.success) {
-      res.status(400).json({
-        error: 'Validation error',
-        details: result.error.issues,
-      })
-      return
-    }
+    if (!result.success) {}
     if (target === 'body') req.body = result.data
     next()
killedBy: POST /api/connection/test returns 400 for missing url
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ObjectLiteral
src/middleware/validate.ts:9:28
     const data = target === 'params' ? req.params : target === 'query' ? req.query : req.body
     const result = schema.safeParse(data)
     if (!result.success) {
-      res.status(400).json({
-        error: 'Validation error',
-        details: result.error.issues,
-      })
+      res.status(400).json({})
       return
     }
killedBy: GET /api/connection returns connection status without API key
statusReason: fetch failed

[Killed] StringLiteral
src/middleware/validate.ts:10:16
     const result = schema.safeParse(data)
     if (!result.success) {
       res.status(400).json({
-        error: 'Validation error',
+        error: "",
         details: result.error.issues,
       })
killedBy: POST /api/connection/test returns 400 for missing url
statusReason: expected { error: '', details: [ { …(4) } ] } to have property "error" with value 'Validation error'

[Killed] EqualityOperator
src/middleware/validate.ts:15:9
       })
       return
     }
-    if (target === 'body') req.body = result.data
+    if (target !== 'body') req.body = result.data
     next()
   }
killedBy: POST /api/connection/test returns 400 for missing url
statusReason: fetch failed

[Killed] ConditionalExpression
src/middleware/validate.ts:15:9
       })
       return
     }
-    if (target === 'body') req.body = result.data
+    if (true) req.body = result.data
     next()
   }
killedBy: POST /api/connection/test returns 400 for missing url
statusReason: fetch failed
