[Killed] BlockStatement
src/routes/connection.ts:8:46
 
 const router = Router()
 
-router.get('/api/connection', (_req, res) => {
-  res.json({
-    url: openfgaClient.url,
-    storeId: openfgaClient.storeId,
-    status: 'connected',
-  })
-})
+router.get('/api/connection', (_req, res) => {})
 
 router.post('/api/connection/test', validate(testConnectionSchema), async (req, res) => {
killedBy: GET /api/connection returns connection status without API key
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/routes/connection.ts:8:12
 
 const router = Router()
 
-router.get('/api/connection', (_req, res) => {
+router.get("", (_req, res) => {
   res.json({
     url: openfgaClient.url,
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: fetch failed

[Killed] BlockStatement
src/routes/connection.ts:16:89
   })
 })
 
-router.post('/api/connection/test', validate(testConnectionSchema), async (req, res) => {
-  const { url } = req.body as { url: string }
-  try {
-    await openfgaClient.testConnection(url)
-    res.json({ status: 'connected' })
-  } catch (err) {
-    res.status(502).json({
-      error: 'Connection failed',
-      details: 'Could not reach OpenFGA instance',
-    })
-  }
-})
+router.post('/api/connection/test', validate(testConnectionSchema), async (req, res) => {})
 
 router.put('/api/connection', validate(updateConnectionSchema), async (req, res) => {
killedBy: GET /api/connection returns connection status without API key
statusReason: fetch failed

[Killed] BlockStatement
src/routes/connection.ts:18:7
 
 router.post('/api/connection/test', validate(testConnectionSchema), async (req, res) => {
   const { url } = req.body as { url: string }
-  try {
-    await openfgaClient.testConnection(url)
-    res.json({ status: 'connected' })
-  } catch (err) {
+  try {} catch (err) {
     res.status(502).json({
       error: 'Connection failed',
killedBy: GET /api/connection returns connection status without API key
statusReason: fetch failed

[Survived] ObjectLiteral
src/routes/connection.ts:20:14
   const { url } = req.body as { url: string }
   try {
     await openfgaClient.testConnection(url)
-    res.json({ status: 'connected' })
+    res.json({})
   } catch (err) {
     res.status(502).json({

[Killed] BlockStatement
src/routes/connection.ts:21:17
   try {
     await openfgaClient.testConnection(url)
     res.json({ status: 'connected' })
-  } catch (err) {
-    res.status(502).json({
-      error: 'Connection failed',
-      details: 'Could not reach OpenFGA instance',
-    })
-  }
+  } catch (err) {}
 })
 
killedBy: POST /api/connection/test returns 502 for unreachable URL
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/routes/connection.ts:29:85
   }
 })
 
-router.put('/api/connection', validate(updateConnectionSchema), async (req, res) => {
-  const { url } = req.body as { url: string }
-  try {
-    await openfgaClient.testConnection(url)
-    openfgaClient.updateUrl(url)
-    res.json({
-      url: openfgaClient.url,
-      storeId: openfgaClient.storeId,
-      status: 'connected',
-    })
-  } catch (err) {
-    res.status(502).json({
-      error: 'Connection failed',
-      details: 'Could not reach OpenFGA instance',
-    })
-  }
-})
+router.put('/api/connection', validate(updateConnectionSchema), async (req, res) => {})
 
 export default router
killedBy: POST /api/connection/test returns 400 for missing url
statusReason: fetch failed

[Killed] StringLiteral
src/routes/connection.ts:29:12
   }
 })
 
-router.put('/api/connection', validate(updateConnectionSchema), async (req, res) => {
+router.put("", validate(updateConnectionSchema), async (req, res) => {
   const { url } = req.body as { url: string }
   try {
killedBy: PUT /api/connection returns 400 for missing url
statusReason: expected 404 to be 400 // Object.is equality

[Killed] BlockStatement
src/routes/connection.ts:31:7
 
 router.put('/api/connection', validate(updateConnectionSchema), async (req, res) => {
   const { url } = req.body as { url: string }
-  try {
-    await openfgaClient.testConnection(url)
-    openfgaClient.updateUrl(url)
-    res.json({
-      url: openfgaClient.url,
-      storeId: openfgaClient.storeId,
-      status: 'connected',
-    })
-  } catch (err) {
+  try {} catch (err) {
     res.status(502).json({
       error: 'Connection failed',
killedBy: POST /api/connection/test returns 400 for missing url
statusReason: fetch failed

[Survived] ObjectLiteral
src/routes/connection.ts:34:14
   try {
     await openfgaClient.testConnection(url)
     openfgaClient.updateUrl(url)
-    res.json({
-      url: openfgaClient.url,
-      storeId: openfgaClient.storeId,
-      status: 'connected',
-    })
+    res.json({})
   } catch (err) {
     res.status(502).json({

[Killed] StringLiteral
src/routes/connection.ts:37:15
     res.json({
       url: openfgaClient.url,
       storeId: openfgaClient.storeId,
-      status: 'connected',
+      status: "",
     })
   } catch (err) {
killedBy: PUT /api/connection returns 502 and reverts URL for unreachable URL
statusReason: fetch failed

[Killed] BlockStatement
src/routes/connection.ts:39:17
       storeId: openfgaClient.storeId,
       status: 'connected',
     })
-  } catch (err) {
-    res.status(502).json({
-      error: 'Connection failed',
-      details: 'Could not reach OpenFGA instance',
-    })
-  }
+  } catch (err) {}
 })
 
killedBy: PUT /api/connection returns 502 and reverts URL for unreachable URL
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/routes/connection.ts:41:14
     })
   } catch (err) {
     res.status(502).json({
-      error: 'Connection failed',
+      error: "",
       details: 'Could not reach OpenFGA instance',
     })
killedBy: PUT /api/connection returns 502 and reverts URL for unreachable URL
statusReason: fetch failed
