[Killed] BooleanLiteral
src/routes/model.ts:6:38
 import { modelParamsSchema } from '../schemas/model.js'
 import { getModel } from '../services/model-service.js'
 
-const router = Router({ mergeParams: true })
+const router = Router({ mergeParams: false })
 
 router.get('/', validate(modelParamsSchema, 'params'), async (req, res) => {
killedBy: PUT /api/connection returns 502 and reverts URL for unreachable URL
statusReason: fetch failed

[Killed] BlockStatement
src/routes/model.ts:8:76
 
 const router = Router({ mergeParams: true })
 
-router.get('/', validate(modelParamsSchema, 'params'), async (req, res) => {
-  const storeId = req.params['storeId'] as string
-  const model = await getModel(storeId)
-  res.json(model)
-})
+router.get('/', validate(modelParamsSchema, 'params'), async (req, res) => {})
 
 export default router
killedBy: POST /api/connection/test returns 502 for unreachable URL
statusReason: fetch failed
