[Killed] BlockStatement
src/routes/stores.ts:10:48
 
 const router = Router()
 
-router.get('/api/stores', async (_req, res) => {
-  const data = await openfgaClient.get('/stores') as ListStoresResponse
-  res.json(data)
-})
+router.get('/api/stores', async (_req, res) => {})
 
 router.post('/api/stores', validate(createStoreSchema), async (req, res) => {
killedBy: POST /api/connection/test returns 502 for unreachable URL
statusReason: fetch failed

[Killed] BlockStatement
src/routes/stores.ts:15:77
   res.json(data)
 })
 
-router.post('/api/stores', validate(createStoreSchema), async (req, res) => {
-  const { name } = req.body as { name: string }
-  const store = await createStore(name)
-  res.status(201).json(store)
-})
+router.post('/api/stores', validate(createStoreSchema), async (req, res) => {})
 
 router.delete('/api/stores/:storeId', async (req, res) => {
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: fetch failed

[Killed] StringLiteral
src/routes/stores.ts:15:13
   res.json(data)
 })
 
-router.post('/api/stores', validate(createStoreSchema), async (req, res) => {
+router.post("", validate(createStoreSchema), async (req, res) => {
   const { name } = req.body as { name: string }
   const store = await createStore(name)
killedBy: POST /api/connection/test returns 502 for unreachable URL
statusReason: fetch failed

[Killed] BlockStatement
src/routes/stores.ts:21:59
   res.status(201).json(store)
 })
 
-router.delete('/api/stores/:storeId', async (req, res) => {
-  const { storeId } = req.params
-  await deleteStore(storeId)
-  res.status(204).send()
-})
+router.delete('/api/stores/:storeId', async (req, res) => {})
 
 export default router
killedBy: GET /api/health still returns ok
statusReason: fetch failed

[Killed] StringLiteral
src/routes/stores.ts:21:15
   res.status(201).json(store)
 })
 
-router.delete('/api/stores/:storeId', async (req, res) => {
+router.delete("", async (req, res) => {
   const { storeId } = req.params
   await deleteStore(storeId)
killedBy: DELETE /api/stores/:storeId returns 204 on successful deletion
statusReason: expected 404 to be 204 // Object.is equality
