[Killed] MethodExpression
src/schemas/model.ts:4:12
 import { z } from 'zod'
 
 export const modelParamsSchema = z.object({
-  storeId: z.string().min(1),
+  storeId: z.string().max(1),
 })
 
killedBy: POST /api/connection/test returns 502 for unreachable URL
statusReason: fetch failed
