[Killed] ObjectLiteral
src/schemas/store.ts:3:43
 import { z } from 'zod'
 
-export const createStoreSchema = z.object({
-  name: z.string().min(1).max(256),
-})
+export const createStoreSchema = z.object({})
 
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
src/schemas/store.ts:4:9
 import { z } from 'zod'
 
 export const createStoreSchema = z.object({
-  name: z.string().min(1).max(256),
+  name: z.string().min(1).min(256),
 })
 
killedBy: GET /api/connection returns connection status without API key
statusReason: fetch failed

[Killed] MethodExpression
src/schemas/store.ts:4:9
 import { z } from 'zod'
 
 export const createStoreSchema = z.object({
-  name: z.string().min(1).max(256),
+  name: z.string().max(1).max(256),
 })
 
killedBy: POST /api/stores creates a store and returns 201
statusReason: expected 400 to be 201 // Object.is equality
