[Killed] ObjectLiteral
src/schemas/connection.ts:3:46
 import { z } from 'zod'
 
-export const testConnectionSchema = z.object({
-  url: z.string().url(),
-})
+export const testConnectionSchema = z.object({})
 
 export const updateConnectionSchema = z.object({
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/schemas/connection.ts:7:48
   url: z.string().url(),
 })
 
-export const updateConnectionSchema = z.object({
-  url: z.string().url(),
-})
+export const updateConnectionSchema = z.object({})
 
killedBy: PUT /api/connection returns 400 for missing url
statusReason: expected 502 to be 400 // Object.is equality
