[Killed] BlockStatement
src/services/store-service.ts:4:69
 import { openfgaClient } from './openfga-client.js'
 import type { StoreInfo } from '../types/openfga.js'
 
-export async function createStore(name: string): Promise<StoreInfo> {
-  const store = await openfgaClient.post('/stores', { name }) as StoreInfo
-  return store
-}
+export async function createStore(name: string): Promise<StoreInfo> {}
 
 export async function deleteStore(storeId: string): Promise<void> {
killedBy: GET /api/stores returns store list from OpenFGA
statusReason: expected 503 to be 200 // Object.is equality

[Killed] BlockStatement
src/services/store-service.ts:9:67
   return store
 }
 
-export async function deleteStore(storeId: string): Promise<void> {
-  await openfgaClient.delete(`/stores/${storeId}`)
-  if (openfgaClient.storeId === storeId) {
-    openfgaClient.storeId = ''
-  }
-}
+export async function deleteStore(storeId: string): Promise<void> {}
 
killedBy: GET /api/connection returns connection status without API key
statusReason: fetch failed

[Killed] ConditionalExpression
src/services/store-service.ts:11:7
 
 export async function deleteStore(storeId: string): Promise<void> {
   await openfgaClient.delete(`/stores/${storeId}`)
-  if (openfgaClient.storeId === storeId) {
+  if (true) {
     openfgaClient.storeId = ''
   }
killedBy: GET /api/stores/:storeId/model returns 200 with model data when model exists
statusReason: expected 503 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/services/store-service.ts:11:7
 
 export async function deleteStore(storeId: string): Promise<void> {
   await openfgaClient.delete(`/stores/${storeId}`)
-  if (openfgaClient.storeId === storeId) {
+  if (false) {
     openfgaClient.storeId = ''
   }
killedBy: store-service deleteStore clears storeId on client when deleting the active store
statusReason: expected 'active-store' to be '' // Object.is equality
