[Survived] ArrayDeclaration
src/startup.ts:13:21
 
 const SMOKE_TEST_MODEL = JSON.stringify({
   schema_version: '1.1',
-  type_definitions: [
-    { type: 'user', relations: {}, metadata: null },
-    { type: 'document', relations: {}, metadata: null },
-  ],
+  type_definitions: [],
 })
 

[Survived] StringLiteral
src/startup.ts:15:13
   schema_version: '1.1',
   type_definitions: [
     { type: 'user', relations: {}, metadata: null },
-    { type: 'document', relations: {}, metadata: null },
+    { type: "", relations: {}, metadata: null },
   ],
 })

[Survived] ObjectLiteral
src/startup.ts:15:5
   schema_version: '1.1',
   type_definitions: [
     { type: 'user', relations: {}, metadata: null },
-    { type: 'document', relations: {}, metadata: null },
+    {},
   ],
 })

[Survived] BlockStatement
src/startup.ts:19:45
   ],
 })
 
-export function validateTransformer(): void {
-  try {
-    transformJSONStringToDSL(SMOKE_TEST_MODEL)
-    const pkg = _require('@openfga/syntax-transformer/package.json') as { version: string }
-    logger.info({ version: pkg.version }, '@openfga/syntax-transformer loaded and validated')
-  } catch (err) {
-    logger.fatal({ err }, '@openfga/syntax-transformer smoke test failed — cannot start')
-    process.exit(1)
-  }
-}
+export function validateTransformer(): void {}
 

[Survived] BlockStatement
src/startup.ts:20:7
 })
 
 export function validateTransformer(): void {
-  try {
-    transformJSONStringToDSL(SMOKE_TEST_MODEL)
-    const pkg = _require('@openfga/syntax-transformer/package.json') as { version: string }
-    logger.info({ version: pkg.version }, '@openfga/syntax-transformer loaded and validated')
-  } catch (err) {
+  try {} catch (err) {
     logger.fatal({ err }, '@openfga/syntax-transformer smoke test failed — cannot start')
     process.exit(1)

[Survived] BlockStatement
src/startup.ts:24:17
     transformJSONStringToDSL(SMOKE_TEST_MODEL)
     const pkg = _require('@openfga/syntax-transformer/package.json') as { version: string }
     logger.info({ version: pkg.version }, '@openfga/syntax-transformer loaded and validated')
-  } catch (err) {
-    logger.fatal({ err }, '@openfga/syntax-transformer smoke test failed — cannot start')
-    process.exit(1)
-  }
+  } catch (err) {}
 }
 
