[Killed] ArrowFunction
src/stores/connection.ts:38:5
   const error = ref<string | null>(null)
 
   const activeStoreName = computed(
-    () => (stores.value ?? []).find((s) => s.id === storeId.value)?.name ?? null
+    () => undefined
   )
 
killedBy: StoreSelector shows store name in input when store is selected
statusReason: expected undefined to be 'Alpha Store' // Object.is equality

[Timeout] ConditionalExpression
src/stores/connection.ts:41:38
     () => (stores.value ?? []).find((s) => s.id === storeId.value)?.name ?? null
   )
 
-  const isConnected = computed(() => status.value === 'connected')
+  const isConnected = computed(() => true)
 
   async function fetchConnection() {
