[Survived] BlockStatement
src/stores/counter.ts:4:61
 import { ref, computed } from 'vue'
 import { defineStore } from 'pinia'
 
-export const useCounterStore = defineStore('counter', () => {
-  const count = ref(0)
-  const doubleCount = computed(() => count.value * 2)
-  function increment() {
-    count.value++
-  }
-
-  return { count, doubleCount, increment }
-})
+export const useCounterStore = defineStore('counter', () => {})
 

[Survived] ArrowFunction
src/stores/counter.ts:6:32
 
 export const useCounterStore = defineStore('counter', () => {
   const count = ref(0)
-  const doubleCount = computed(() => count.value * 2)
+  const doubleCount = computed(() => undefined)
   function increment() {
     count.value++

[Survived] ArithmeticOperator
src/stores/counter.ts:6:38
 
 export const useCounterStore = defineStore('counter', () => {
   const count = ref(0)
-  const doubleCount = computed(() => count.value * 2)
+  const doubleCount = computed(() => count.value / 2)
   function increment() {
     count.value++

[Survived] BlockStatement
src/stores/counter.ts:7:24
 export const useCounterStore = defineStore('counter', () => {
   const count = ref(0)
   const doubleCount = computed(() => count.value * 2)
-  function increment() {
-    count.value++
-  }
+  function increment() {}
 
   return { count, doubleCount, increment }

[Survived] UpdateOperator
src/stores/counter.ts:8:5
   const count = ref(0)
   const doubleCount = computed(() => count.value * 2)
   function increment() {
-    count.value++
+    count.value--
   }
 
