[Killed] BlockStatement
src/stores/stores.ts:30:32
   const error = ref<string | null>(null)
   const hasNavigatedThisSession = ref(false)
 
-  async function fetchStores() {
-    loading.value = true
-    error.value = null
-    try {
-      const data = await api.get<ListStoresResponse>('stores')
-      storeList.value = data.stores
-    } catch (err) {
-      error.value = (err as Error).message
-    } finally {
-      loading.value = false
-    }
-  }
+  async function fetchStores() {}
 
   async function createStore(name: string): Promise<StoreInfo> {
killedBy: useStoresStore fetchStores() populates storeList on success
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/stores/stores.ts:33:9
   async function fetchStores() {
     loading.value = true
     error.value = null
-    try {
-      const data = await api.get<ListStoresResponse>('stores')
-      storeList.value = data.stores
-    } catch (err) {
+    try {} catch (err) {
       error.value = (err as Error).message
     } finally {
killedBy: useStoresStore fetchStores() populates storeList on success
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/stores/stores.ts:36:19
     try {
       const data = await api.get<ListStoresResponse>('stores')
       storeList.value = data.stores
-    } catch (err) {
-      error.value = (err as Error).message
-    } finally {
+    } catch (err) {} finally {
       loading.value = false
     }
killedBy: useStoresStore fetchStores() sets error on failure
statusReason: expected null to be 'Fetch failed' // Object.is equality

[Killed] BlockStatement
src/stores/stores.ts:43:64
     }
   }
 
-  async function createStore(name: string): Promise<StoreInfo> {
-    const store = await api.post<StoreInfo>('stores', { name })
-    storeList.value.push(store)
-    toast.show({ type: 'success', message: 'Store created' })
-    return store
-  }
+  async function createStore(name: string): Promise<StoreInfo> {}
 
   async function deleteStore(storeId: string): Promise<void> {
killedBy: useStoresStore createStore() adds store to list and shows success toast
statusReason: expected undefined to deeply equal { Object (id, name, ...) }

[Killed] BlockStatement
src/stores/stores.ts:50:62
     return store
   }
 
-  async function deleteStore(storeId: string): Promise<void> {
-    await api.del<void>(`stores/${storeId}`)
-    storeList.value = storeList.value.filter((s) => s.id !== storeId)
-    toast.show({ type: 'success', message: 'Store deleted' })
-  }
+  async function deleteStore(storeId: string): Promise<void> {}
 
   function selectStore(storeId: string) {
killedBy: useStoresStore deleteStore() removes store from list and shows success toast
statusReason: expected [ { id: 'del-1', …(3) }, …(1) ] to have a length of 1 but got 2

[Survived] StringLiteral
src/stores/stores.ts:51:25
   }
 
   async function deleteStore(storeId: string): Promise<void> {
-    await api.del<void>(`stores/${storeId}`)
+    await api.del<void>(``)
     storeList.value = storeList.value.filter((s) => s.id !== storeId)
     toast.show({ type: 'success', message: 'Store deleted' })

[Killed] MethodExpression
src/stores/stores.ts:52:23
 
   async function deleteStore(storeId: string): Promise<void> {
     await api.del<void>(`stores/${storeId}`)
-    storeList.value = storeList.value.filter((s) => s.id !== storeId)
+    storeList.value = storeList.value
     toast.show({ type: 'success', message: 'Store deleted' })
   }
killedBy: useStoresStore deleteStore() removes store from list and shows success toast
statusReason: expected [ { id: 'del-1', …(3) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/stores/stores.ts:52:53
 
   async function deleteStore(storeId: string): Promise<void> {
     await api.del<void>(`stores/${storeId}`)
-    storeList.value = storeList.value.filter((s) => s.id !== storeId)
+    storeList.value = storeList.value.filter((s) => true)
     toast.show({ type: 'success', message: 'Store deleted' })
   }
killedBy: useStoresStore deleteStore() removes store from list and shows success toast
statusReason: expected [ { id: 'del-1', …(3) }, …(1) ] to have a length of 1 but got 2

[Killed] StringLiteral
src/stores/stores.ts:53:24
   async function deleteStore(storeId: string): Promise<void> {
     await api.del<void>(`stores/${storeId}`)
     storeList.value = storeList.value.filter((s) => s.id !== storeId)
-    toast.show({ type: 'success', message: 'Store deleted' })
+    toast.show({ type: "", message: 'Store deleted' })
   }
 
killedBy: useStoresStore deleteStore() removes store from list and shows success toast
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/stores/stores.ts:61:19
     connectionStore.selectStore(storeId)
     if (!hasNavigatedThisSession.value) {
       hasNavigatedThisSession.value = true
-      router.push('/model-viewer')
+      router.push("")
     }
   }
killedBy: useStoresStore selectStore() navigates to /model-viewer on first selection
statusReason: expected "vi.fn()" to be called with arguments: [ '/model-viewer' ]

Received:

  1st vi.fn() call:

  [
-   "/model-viewer",
