[Timeout] ArrayDeclaration
src/stores/connection.ts:33:35
   const url = ref<string>('')
   const storeId = ref<string>('')
   const status = ref<'connected' | 'error' | 'loading'>('loading')
-  const stores = ref<StoreInfo[]>([])
+  const stores = ref<StoreInfo[]>(["Stryker was here"])
   const loading = ref<boolean>(false)
   const error = ref<string | null>(null)

[Killed] BooleanLiteral
src/stores/connection.ts:34:32
   const storeId = ref<string>('')
   const status = ref<'connected' | 'error' | 'loading'>('loading')
   const stores = ref<StoreInfo[]>([])
-  const loading = ref<boolean>(false)
+  const loading = ref<boolean>(true)
   const error = ref<string | null>(null)
 
killedBy: useConnectionStore initial state is loading with empty values
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/stores/connection.ts:38:11
   const error = ref<string | null>(null)
 
   const activeStoreName = computed(
-    () => (stores.value ?? []).find((s) => s.id === storeId.value)?.name ?? null
+    () => (stores.value ?? []).find(s => s.id === storeId.value)?.name && null
   )
 
killedBy: StoreSelector shows store name in input when store is selected
statusReason: expected null to be 'Alpha Store' // Object.is equality

[Killed] ConditionalExpression
src/stores/connection.ts:38:44
   const error = ref<string | null>(null)
 
   const activeStoreName = computed(
-    () => (stores.value ?? []).find((s) => s.id === storeId.value)?.name ?? null
+    () => (stores.value ?? []).find((s) => false)?.name ?? null
   )
 
killedBy: StoreSelector shows store name in input when store is selected
statusReason: expected null to be 'Alpha Store' // Object.is equality

[Killed] ConditionalExpression
src/stores/connection.ts:41:38
     () => (stores.value ?? []).find((s) => s.id === storeId.value)?.name ?? null
   )
 
-  const isConnected = computed(() => status.value === 'connected')
+  const isConnected = computed(() => false)
 
   async function fetchConnection() {
killedBy: useConnectionStore isConnected computed returns true when status is connected
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/stores/connection.ts:41:32
     () => (stores.value ?? []).find((s) => s.id === storeId.value)?.name ?? null
   )
 
-  const isConnected = computed(() => status.value === 'connected')
+  const isConnected = computed(() => undefined)
 
   async function fetchConnection() {
killedBy: useConnectionStore isConnected computed returns true when status is connected
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/stores/connection.ts:43:36
 
   const isConnected = computed(() => status.value === 'connected')
 
-  async function fetchConnection() {
-    loading.value = true
-    error.value = null
-    try {
-      const data = await api.get<ConnectionStatus>('connection')
-      url.value = data.url
-      storeId.value = data.storeId
-      status.value = 'connected'
-    } catch (err) {
-      status.value = 'error'
-      error.value = (err as Error).message
-    } finally {
-      loading.value = false
-    }
-  }
+  async function fetchConnection() {}
 
   async function testConnection(testUrl: string): Promise<boolean> {
killedBy: AppHeader calls fetchConnection and fetchStores on mount
statusReason: expected "vi.fn()" to be called with arguments: [ '/api/connection' ]

Received:

  1st vi.fn() call:

  [
-   "/api/connection",

[Survived] BooleanLiteral
src/stores/connection.ts:44:21
   const isConnected = computed(() => status.value === 'connected')
 
   async function fetchConnection() {
-    loading.value = true
+    loading.value = false
     error.value = null
     try {

[Killed] BlockStatement
src/stores/connection.ts:46:9
   async function fetchConnection() {
     loading.value = true
     error.value = null
-    try {
-      const data = await api.get<ConnectionStatus>('connection')
-      url.value = data.url
-      storeId.value = data.storeId
-      status.value = 'connected'
-    } catch (err) {
+    try {} catch (err) {
       status.value = 'error'
       error.value = (err as Error).message
killedBy: AppHeader calls fetchConnection and fetchStores on mount
statusReason: expected "vi.fn()" to be called with arguments: [ '/api/connection' ]

Received:

  1st vi.fn() call:

  [
-   "/api/connection",

[Killed] StringLiteral
src/stores/connection.ts:47:52
     loading.value = true
     error.value = null
     try {
-      const data = await api.get<ConnectionStatus>('connection')
+      const data = await api.get<ConnectionStatus>("")
       url.value = data.url
       storeId.value = data.storeId
killedBy: AppHeader calls fetchConnection and fetchStores on mount
statusReason: expected "vi.fn()" to be called with arguments: [ '/api/connection' ]

Received:

  1st vi.fn() call:

  [
-   "/api/connection",

[Killed] BlockStatement
src/stores/connection.ts:51:19
       url.value = data.url
       storeId.value = data.storeId
       status.value = 'connected'
-    } catch (err) {
-      status.value = 'error'
-      error.value = (err as Error).message
-    } finally {
+    } catch (err) {} finally {
       loading.value = false
     }
killedBy: useConnectionStore fetchConnection() sets status to error on failure
statusReason: expected 'loading' to be 'error' // Object.is equality

[Killed] BlockStatement
src/stores/connection.ts:54:15
     } catch (err) {
       status.value = 'error'
       error.value = (err as Error).message
-    } finally {
-      loading.value = false
-    }
+    } finally {}
   }
 
killedBy: useConnectionStore fetchConnection() updates url/storeId/status on success
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/connection.ts:55:23
       status.value = 'error'
       error.value = (err as Error).message
     } finally {
-      loading.value = false
+      loading.value = true
     }
   }
killedBy: useConnectionStore fetchConnection() updates url/storeId/status on success
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/connection.ts:59:68
     }
   }
 
-  async function testConnection(testUrl: string): Promise<boolean> {
-    try {
-      await api.post<TestConnectionResponse>('connection/test', { url: testUrl })
-      return true
-    } catch {
-      return false
-    }
-  }
+  async function testConnection(testUrl: string): Promise<boolean> {}
 
   async function updateConnection(newUrl: string) {
killedBy: useConnectionStore testConnection() returns true on success
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/stores/connection.ts:60:9
   }
 
   async function testConnection(testUrl: string): Promise<boolean> {
-    try {
-      await api.post<TestConnectionResponse>('connection/test', { url: testUrl })
-      return true
-    } catch {
+    try {} catch {
       return false
     }
killedBy: useConnectionStore testConnection() returns true on success
statusReason: expected undefined to be true // Object.is equality

[Killed] StringLiteral
src/stores/connection.ts:61:46
 
   async function testConnection(testUrl: string): Promise<boolean> {
     try {
-      await api.post<TestConnectionResponse>('connection/test', { url: testUrl })
+      await api.post<TestConnectionResponse>("", { url: testUrl })
       return true
     } catch {
killedBy: useConnectionStore testConnection() returns true on success
statusReason: expected "vi.fn()" to be called with arguments: [ '/api/connection/test', Any<Object> ]

Received:

  1st vi.fn() call:

  [
-   "/api/connection/test",

[Survived] ObjectLiteral
src/stores/connection.ts:61:65
 
   async function testConnection(testUrl: string): Promise<boolean> {
     try {
-      await api.post<TestConnectionResponse>('connection/test', { url: testUrl })
+      await api.post<TestConnectionResponse>('connection/test', {})
       return true
     } catch {

[Killed] BooleanLiteral
src/stores/connection.ts:62:14
   async function testConnection(testUrl: string): Promise<boolean> {
     try {
       await api.post<TestConnectionResponse>('connection/test', { url: testUrl })
-      return true
+      return false
     } catch {
       return false
killedBy: useConnectionStore testConnection() returns true on success
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/stores/connection.ts:63:13
     try {
       await api.post<TestConnectionResponse>('connection/test', { url: testUrl })
       return true
-    } catch {
-      return false
-    }
+    } catch {}
   }
 
killedBy: useConnectionStore testConnection() returns false on failure
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/connection.ts:64:14
       await api.post<TestConnectionResponse>('connection/test', { url: testUrl })
       return true
     } catch {
-      return false
+      return true
     }
   }
killedBy: useConnectionStore testConnection() returns false on failure
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/connection.ts:68:51
     }
   }
 
-  async function updateConnection(newUrl: string) {
-    loading.value = true
-    error.value = null
-    try {
-      const data = await api.put<ConnectionStatus>('connection', { url: newUrl })
-      url.value = data.url
-      storeId.value = data.storeId
-      status.value = 'connected'
-      await fetchStores()
-    } catch (err) {
-      status.value = 'error'
-      error.value = (err as Error).message
-    } finally {
-      loading.value = false
-    }
-  }
+  async function updateConnection(newUrl: string) {}
 
   async function fetchStores() {
killedBy: useConnectionStore updateConnection() updates url and fetches stores on success
statusReason: expected '' to be 'http://new:8080' // Object.is equality

[Survived] BooleanLiteral
src/stores/connection.ts:69:21
   }
 
   async function updateConnection(newUrl: string) {
-    loading.value = true
+    loading.value = false
     error.value = null
     try {

[Killed] BlockStatement
src/stores/connection.ts:71:9
   async function updateConnection(newUrl: string) {
     loading.value = true
     error.value = null
-    try {
-      const data = await api.put<ConnectionStatus>('connection', { url: newUrl })
-      url.value = data.url
-      storeId.value = data.storeId
-      status.value = 'connected'
-      await fetchStores()
-    } catch (err) {
+    try {} catch (err) {
       status.value = 'error'
       error.value = (err as Error).message
killedBy: useConnectionStore updateConnection() updates url and fetches stores on success
statusReason: expected '' to be 'http://new:8080' // Object.is equality

[Survived] StringLiteral
src/stores/connection.ts:72:52
     loading.value = true
     error.value = null
     try {
-      const data = await api.put<ConnectionStatus>('connection', { url: newUrl })
+      const data = await api.put<ConnectionStatus>("", { url: newUrl })
       url.value = data.url
       storeId.value = data.storeId

[Survived] ObjectLiteral
src/stores/connection.ts:72:66
     loading.value = true
     error.value = null
     try {
-      const data = await api.put<ConnectionStatus>('connection', { url: newUrl })
+      const data = await api.put<ConnectionStatus>('connection', {})
       url.value = data.url
       storeId.value = data.storeId

[Survived] BlockStatement
src/stores/connection.ts:77:19
       storeId.value = data.storeId
       status.value = 'connected'
       await fetchStores()
-    } catch (err) {
-      status.value = 'error'
-      error.value = (err as Error).message
-    } finally {
+    } catch (err) {} finally {
       loading.value = false
     }

[Killed] BlockStatement
src/stores/connection.ts:85:32
     }
   }
 
-  async function fetchStores() {
-    try {
-      const data = await api.get<ListStoresResponse>('stores')
-      stores.value = data.stores
-    } catch {
-      // non-fatal: keep existing stores
-    }
-  }
+  async function fetchStores() {}
 
   function selectStore(id: string) {
killedBy: AppHeader calls fetchConnection and fetchStores on mount
statusReason: expected "vi.fn()" to be called with arguments: [ '/api/stores' ]

Received:

  1st vi.fn() call:

  [
-   "/api/stores",

[Killed] BlockStatement
src/stores/connection.ts:86:9
   }
 
   async function fetchStores() {
-    try {
-      const data = await api.get<ListStoresResponse>('stores')
-      stores.value = data.stores
-    } catch {
+    try {} catch {
       // non-fatal: keep existing stores
     }
killedBy: AppHeader calls fetchConnection and fetchStores on mount
statusReason: expected "vi.fn()" to be called with arguments: [ '/api/stores' ]

Received:

  1st vi.fn() call:

  [
-   "/api/stores",

[Killed] BlockStatement
src/stores/connection.ts:94:36
     }
   }
 
-  function selectStore(id: string) {
-    storeId.value = id
-  }
+  function selectStore(id: string) {}
 
   return {
killedBy: ModelViewer calls modelStore.fetchModel on mount when store is selected
statusReason: expected "wrappedAction" to be called with arguments: [ 'store-1' ]

Number of calls: 0
