[Survived] StringLiteral
src/stores/stores.ts:20:43
   continuation_token?: string
 }
 
-export const useStoresStore = defineStore('stores', () => {
+export const useStoresStore = defineStore("", () => {
   const api = useApi()
   const toast = useToast()

[Killed] BooleanLiteral
src/stores/stores.ts:26:23
   const router = useRouter()
 
   const storeList = ref<StoreInfo[]>([])
-  const loading = ref(false)
+  const loading = ref(true)
   const error = ref<string | null>(null)
   const hasNavigatedThisSession = ref(false)
killedBy: useStoresStore initial state is empty
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/stores/stores.ts:28:39
   const storeList = ref<StoreInfo[]>([])
   const loading = ref(false)
   const error = ref<string | null>(null)
-  const hasNavigatedThisSession = ref(false)
+  const hasNavigatedThisSession = ref(true)
 
   async function fetchStores() {
killedBy: useStoresStore initial state is empty
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/stores/stores.ts:30:32
   const error = ref<string | null>(null)
   const hasNavigatedThisSession = ref(false)
 
-  async function fetchStores() {
-    loading.value = true
-    error.value = null
-    try {
-      const data = await api.get<ListStoresResponse>('stores')
-      storeList.value = data.stores ?? []
-    } catch (err) {
-      error.value = (err as Error).message
-    } finally {
-      loading.value = false
-    }
-  }
+  async function fetchStores() {}
 
   async function createStore(name: string): Promise<StoreInfo> {
killedBy: useStoresStore fetchStores() populates storeList on success
statusReason: expected [] to have a length of 2 but got +0

[Survived] BooleanLiteral
src/stores/stores.ts:31:21
   const hasNavigatedThisSession = ref(false)
 
   async function fetchStores() {
-    loading.value = true
+    loading.value = false
     error.value = null
     try {

[Killed] BlockStatement
src/stores/stores.ts:33:9
   async function fetchStores() {
     loading.value = true
     error.value = null
-    try {
-      const data = await api.get<ListStoresResponse>('stores')
-      storeList.value = data.stores ?? []
-    } catch (err) {
+    try {} catch (err) {
       error.value = (err as Error).message
     } finally {
killedBy: useStoresStore fetchStores() populates storeList on success
statusReason: expected [] to have a length of 2 but got +0

[Survived] StringLiteral
src/stores/stores.ts:34:54
     loading.value = true
     error.value = null
     try {
-      const data = await api.get<ListStoresResponse>('stores')
+      const data = await api.get<ListStoresResponse>("")
       storeList.value = data.stores ?? []
     } catch (err) {

[Killed] LogicalOperator
src/stores/stores.ts:35:25
     error.value = null
     try {
       const data = await api.get<ListStoresResponse>('stores')
-      storeList.value = data.stores ?? []
+      storeList.value = data.stores && []
     } catch (err) {
       error.value = (err as Error).message
killedBy: useStoresStore fetchStores() populates storeList on success
statusReason: expected [] to have a length of 2 but got +0

[Survived] ArrayDeclaration
src/stores/stores.ts:35:40
     error.value = null
     try {
       const data = await api.get<ListStoresResponse>('stores')
-      storeList.value = data.stores ?? []
+      storeList.value = data.stores ?? ["Stryker was here"]
     } catch (err) {
       error.value = (err as Error).message

[Killed] BlockStatement
src/stores/stores.ts:36:19
     try {
       const data = await api.get<ListStoresResponse>('stores')
       storeList.value = data.stores ?? []
-    } catch (err) {
-      error.value = (err as Error).message
-    } finally {
+    } catch (err) {} finally {
       loading.value = false
     }
killedBy: useStoresStore fetchStores() sets error on failure
statusReason: expected null to be 'Fetch failed' // Object.is equality

[Killed] BlockStatement
src/stores/stores.ts:43:64
     }
   }
 
-  async function createStore(name: string): Promise<StoreInfo> {
-    const store = await api.post<StoreInfo>('stores', { name })
-    storeList.value.push(store)
-    const connectionStore = useConnectionStore()
-    connectionStore.stores.push(store)
-    toast.show({ type: 'success', message: 'Store created' })
-    return store
-  }
+  async function createStore(name: string): Promise<StoreInfo> {}
 
   async function deleteStore(storeId: string): Promise<void> {
killedBy: useStoresStore createStore() adds store to list and shows success toast
statusReason: expected undefined to deeply equal { Object (id, name, ...) }

[Killed] BlockStatement
src/stores/stores.ts:52:62
     return store
   }
 
-  async function deleteStore(storeId: string): Promise<void> {
-    await api.del<void>(`stores/${storeId}`)
-    storeList.value = storeList.value.filter((s) => s.id !== storeId)
-    const connectionStore = useConnectionStore()
-    connectionStore.stores = connectionStore.stores.filter((s) => s.id !== storeId)
-    toast.show({ type: 'success', message: 'Store deleted' })
-  }
+  async function deleteStore(storeId: string): Promise<void> {}
 
   function selectStore(storeId: string) {
killedBy: useStoresStore deleteStore() removes store from list and shows success toast
statusReason: expected [ { id: 'del-1', …(3) }, …(1) ] to have a length of 1 but got 2

[Killed] EqualityOperator
src/stores/stores.ts:54:53
 
   async function deleteStore(storeId: string): Promise<void> {
     await api.del<void>(`stores/${storeId}`)
-    storeList.value = storeList.value.filter((s) => s.id !== storeId)
+    storeList.value = storeList.value.filter((s) => s.id === storeId)
     const connectionStore = useConnectionStore()
     connectionStore.stores = connectionStore.stores.filter((s) => s.id !== storeId)
killedBy: useStoresStore deleteStore() removes store from list and shows success toast
statusReason: expected 'del-1' to be 'keep-1' // Object.is equality

[Killed] ArrowFunction
src/stores/stores.ts:54:46
 
   async function deleteStore(storeId: string): Promise<void> {
     await api.del<void>(`stores/${storeId}`)
-    storeList.value = storeList.value.filter((s) => s.id !== storeId)
+    storeList.value = storeList.value.filter(() => undefined)
     const connectionStore = useConnectionStore()
     connectionStore.stores = connectionStore.stores.filter((s) => s.id !== storeId)
killedBy: useStoresStore deleteStore() removes store from list and shows success toast
statusReason: expected [] to have a length of 1 but got +0

[Survived] ConditionalExpression
src/stores/stores.ts:56:67
     await api.del<void>(`stores/${storeId}`)
     storeList.value = storeList.value.filter((s) => s.id !== storeId)
     const connectionStore = useConnectionStore()
-    connectionStore.stores = connectionStore.stores.filter((s) => s.id !== storeId)
+    connectionStore.stores = connectionStore.stores.filter((s) => true)
     toast.show({ type: 'success', message: 'Store deleted' })
   }

[Survived] ConditionalExpression
src/stores/stores.ts:56:67
     await api.del<void>(`stores/${storeId}`)
     storeList.value = storeList.value.filter((s) => s.id !== storeId)
     const connectionStore = useConnectionStore()
-    connectionStore.stores = connectionStore.stores.filter((s) => s.id !== storeId)
+    connectionStore.stores = connectionStore.stores.filter((s) => false)
     toast.show({ type: 'success', message: 'Store deleted' })
   }

[Killed] BlockStatement
src/stores/stores.ts:60:41
     toast.show({ type: 'success', message: 'Store deleted' })
   }
 
-  function selectStore(storeId: string) {
-    const connectionStore = useConnectionStore()
-    connectionStore.selectStore(storeId)
-    if (!hasNavigatedThisSession.value) {
-      hasNavigatedThisSession.value = true
-      router.push('/model-viewer')
-    }
-  }
+  function selectStore(storeId: string) {}
 
   return {
killedBy: useStoresStore selectStore() navigates to /model-viewer on first selection
statusReason: expected '' to be 'store-1' // Object.is equality

[Killed] BooleanLiteral
src/stores/stores.ts:63:9
   function selectStore(storeId: string) {
     const connectionStore = useConnectionStore()
     connectionStore.selectStore(storeId)
-    if (!hasNavigatedThisSession.value) {
+    if (hasNavigatedThisSession.value) {
       hasNavigatedThisSession.value = true
       router.push('/model-viewer')
killedBy: useStoresStore selectStore() navigates to /model-viewer on first selection
statusReason: expected "vi.fn()" to be called with arguments: [ '/model-viewer' ]

Number of calls: 0

[Killed] BlockStatement
src/stores/stores.ts:63:41
   function selectStore(storeId: string) {
     const connectionStore = useConnectionStore()
     connectionStore.selectStore(storeId)
-    if (!hasNavigatedThisSession.value) {
-      hasNavigatedThisSession.value = true
-      router.push('/model-viewer')
-    }
+    if (!hasNavigatedThisSession.value) {}
   }
 
killedBy: useStoresStore selectStore() navigates to /model-viewer on first selection
statusReason: expected "vi.fn()" to be called with arguments: [ '/model-viewer' ]

Number of calls: 0

[Killed] BooleanLiteral
src/stores/stores.ts:64:39
     const connectionStore = useConnectionStore()
     connectionStore.selectStore(storeId)
     if (!hasNavigatedThisSession.value) {
-      hasNavigatedThisSession.value = true
+      hasNavigatedThisSession.value = false
       router.push('/model-viewer')
     }
killedBy: useStoresStore selectStore() navigates to /model-viewer on first selection
statusReason: expected false to be true // Object.is equality
